Updated the code for transaction diagrams Fixed the Swimlane diagrams
